Marks100/STM32_RFM69_receiver/Src/CLI/CLI.c
/***************************************************************************************************
**                              Includes                                                          **
***************************************************************************************************/
#include "stm32f10x_rcc.h"
#include "stm32f10x_usart.h"
#include "stm32f10x_gpio.h"
#include "misc.h"

#include <stdint.h>
#include <stddef.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "C_defs.h"
#include "STDC.h"
#include "NVM.h"
#include "HAL_BRD.h"
#include "COMPILER_defs.h"

#include "HAL_UART.h"
#include "CLI.h"

extern NVM_info_st        NVM_info_s;

/* Debug display strings */
const char CLI_welcome_message_s[] =
        "\r\n\n\rHello...\r\nCLI Console is now open, Type 'help' for list of commands";

const char CLI_closing_serial_port_s[] =
        "\r\nClosing serial port due to inactivity to save power, please press the \"Enter\" key to re-open the debug prompt";

const char CLI_newline[] =
        "\r\n";

const char* CLI_err_string[ CLI_ERROR_MAX ] =
{
    "\r",
    "\r",
    "\r\nOperation failed\r\n",
    "\r\nToo many arguments\r\n",
    "\r\nInvalid arguments\r\n",
    "\r\nCommand not supported\r\n",
    "\r\nCommand prohibited in this mode\r\n",
    "\r\nCommand not found\r\n",
    "\r\nOut of range\r\n",
    "\r\nInvalid Hex param\r\n",
    "\r\nInvalid Dec param\r\n",
    "\r\nInvalid hex param length\r\n",
    "\r\nInvalid Dec param length\r\n",
    "\r\nValue is already set\r\n",
    "\r\nInvalid string input\r\n"
};

STATIC u8_t               CLI_byte_index_s;
STATIC u8_t               CLI_rx_command_len;
STATIC false_true_et      CLI_cr_received_s;
STATIC char               CLI_msg_read_s[CLI_MAX_INPUT_CHARS + 1];
STATIC CLI_cmd_history_st CLI_cmd_history_s;


STATIC const CLI_Command_st CLI_commands[] =
{
	 {"help",		&help_handler,			HELP_HELP, 				SUPPORTED_FOR_ALL_MODES, ENABLE, 0, { NULL_PARAM_LIST } },
	 {"ver",		&ver_handler,			HELP_VER , 				SUPPORTED_FOR_ALL_MODES, ENABLE, 0, { NULL_PARAM_LIST } },
	 {"setmode",	&setmode_handler,	    HELP_SET_MODE, 			SUPPORTED_FOR_ALL_MODES, ENABLE, 1, { NULL_PARAM_LIST } },
	 {"reset",		&reset_handler,	    	HELP_RESET, 			SUPPORTED_FOR_ALL_MODES, ENABLE, 0, { NULL_PARAM_LIST } },
	 {"readnvm",	&readnvm_handler,	    HELP_NVM, 	    		SUPPORTED_FOR_ALL_MODES, ENABLE, 0, { NULL_PARAM_LIST } },
	 {"setid",	    &setid_handler,	        HELP_SET_ID, 	        SUPPORTED_FOR_ALL_MODES, ENABLE, 1, { SET_ID_CMD_PARAM_LIST } },
	 {"nvm",		&nvm_handler,			HELP_NVM,				SUPPORTED_FOR_ALL_MODES, ENABLE, 0, { NULL_PARAM_LIST } },
	 {NULL,			NULL,					NULL,					SUPPORTED_FOR_ALL_MODES, ENABLE, 0, { NULL_PARAM_LIST } },
};



void CLI_init( void )
{
	u8_t i = 0u;

    CLI_byte_index_s = 0u;
    CLI_rx_command_len = 0u;
    CLI_cr_received_s = 0u;

    STDC_memset( CLI_msg_read_s, 0x20, sizeof( CLI_msg_read_s ) );

    /* Reload the command history :) */
    for( i = 0u; i < CLI_MAX_COMMAND_HISTORY; i++ )
	{
		STDC_memcpy( &CLI_cmd_history_s.cmd_list[i], &NVM_info_s.NVM_generic_data_blk_s.cmd_list[i], sizeof( CLI_cmd_history_s.cmd_list ) );
	}

    /* Init the HAL UART driver */
    HAL_UART_init();

    /* Print a welcome message */
    CLI_print_welcome_message();

    CLI_print_prompt( TRUE );
}


void CLI_message_handler( void )
{
    if( CLI_carriage_return_check() == TRUE )
    {
        /* Reset the carriage return flag */
        CLI_cr_received_s = FALSE;

        /* handle the actual received command */
        CLI_handle_serial_command();

        /* Clear out the buffers */
        CLI_clear_rx_buffer();

        CLI_print_prompt( TRUE );
    }
}


void CLI_handle_serial_command ( void )
{
	CLI_error_et error = CLI_ERROR_NONE;
	char *argVector[ CLI_CMD_LINE_ARGS_MAX ];
	u8_t argument_count = 0u;

	char  output_string[100];
	STDC_memset( output_string, 0, sizeof( output_string ) );

	error = CLI_parse_cmd( CLI_msg_read_s, &argument_count, argVector, CLI_CMD_LINE_ARGS_MAX );

	if( error == CLI_ERROR_NONE )
	{
		error = CLI_process_cmd( argument_count, argVector );
	}

	strcpy( output_string, CLI_err_string[error] );

	CLI_send_data( output_string, strlen(output_string) );
}

/*!
****************************************************************************************************
*
*   \brief         Check each charachter received
*
*   \author        MS
*
*   \return        void
*
***************************************************************************************************/

void CLI_handle_received_char( u8_t received_char )
{
    u8_t useable_commands = 0u;
    u8_t i = 0;

    if( ( ( received_char >= CLI_SPACE ) && ( received_char <= CLI_DEL ) ) || ( received_char <= CLI_CR ) )
    {
        if ( received_char == '\r')
        {
            CLI_rx_command_len = CLI_byte_index_s;
            CLI_byte_index_s = 0u;

            /* We have received a Carriage Return, so lets set this flag to let the system know a
            command has been received */
            CLI_cr_received_s = TRUE;
            CLI_send_data( "\n", sizeof(received_char) );

            if( CLI_rx_command_len != 0u )
            {
                STDC_memset( &CLI_cmd_history_s.cmd_list[CLI_cmd_history_s.index_to_next_cmd].cmd, 0x00, sizeof( CLI_cmd_history_s.cmd_list[CLI_cmd_history_s.index_to_next_cmd].cmd ) );

                STDC_memcpy( &CLI_cmd_history_s.cmd_list[CLI_cmd_history_s.index_to_next_cmd].cmd, CLI_msg_read_s, CLI_rx_command_len );

                CLI_cmd_history_s.index_to_next_cmd = ( CLI_cmd_history_s.index_to_next_cmd + 1u )%CLI_MAX_COMMAND_HISTORY;
            }

            CLI_store_history();
        }
        else if( received_char == CLI_DEL )
        {
            CLI_byte_index_s = 0u;
            STDC_memset( CLI_msg_read_s, 0x00, sizeof( CLI_msg_read_s ) );
            CLI_msg_read_s[ CLI_byte_index_s ] = 0u;
            CLI_send_data( (u8_t*)ERASE_CURRENT_LINE, strlen(ERASE_CURRENT_LINE));
            CLI_print_prompt( FALSE );
        }
        else if ( received_char == CLI_BACKSPACE )
        {
        	if( CLI_byte_index_s > 0u )
        	{
				CLI_byte_index_s--;
				CLI_msg_read_s[ CLI_byte_index_s ] = 0x00;
				CLI_send_data( "\b ", strlen("\b ") );
				CLI_send_data( &received_char, 1u );
        	}

            return;
        }
        else if( ( received_char == UP_ARROW || received_char == DOWN_ARROW ) && ( CLI_msg_read_s[ CLI_byte_index_s - 1u ] == '[' ) )
        {
            //received 'A' and may be we had received a '[' previously which means a up arrow has been hit.
            //load the previous command and print it and wait for the carriage return
            CLI_msg_read_s[ CLI_byte_index_s++ ] = received_char;

            /* count the number of non 0 commands */
            for( i = 0u; i < CLI_MAX_COMMAND_HISTORY; i++ )
            {
            	if( CLI_cmd_history_s.cmd_list[i].cmd[0] != 0x00 )
            	{
            		useable_commands += 1u;
            	}
            }

            /* Ifthere are no useable commands then dont allow the user to scroll up or down */
            if( useable_commands != 0u )
            {
				if( received_char == UP_ARROW )
				{
					if( CLI_cmd_history_s.index_to_next_cmd == 0u )
					{
						CLI_cmd_history_s.index_to_next_cmd = ( useable_commands - 1u );
					}
					else
					{
						CLI_cmd_history_s.index_to_next_cmd -= 1u;
					}
				}
				else
				{
					CLI_cmd_history_s.index_to_next_cmd = ( ( CLI_cmd_history_s.index_to_next_cmd + 1u ) % useable_commands );
				}

